FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/usbh_reg.h
#define USBH_HcControl_CBSR_Pos             ( 0 )                                               /*!< USBH_T::HcControl: CBSR Position       */
#define USBH_HcControl_CBSR_Msk             ( 0x3ul << USBH_HcControl_CBSR_Pos )                /*!< USBH_T::HcControl: CBSR Mask           */

#define USBH_HcControl_PLE_Pos              ( 2 )                                               /*!< USBH_T::HcControl: PLE Position        */
#define USBH_HcControl_PLE_Msk              ( 0x1ul << USBH_HcControl_PLE_Pos )                 /*!< USBH_T::HcControl: PLE Mask            */

#define USBH_HcControl_IE_Pos               ( 3 )                                               /*!< USBH_T::HcControl: IE Position         */
#define USBH_HcControl_IE_Msk               ( 0x1ul << USBH_HcControl_IE_Pos )                  /*!< USBH_T::HcControl: IE Mask             */

#define USBH_HcControl_CLE_Pos              ( 4 )                                               /*!< USBH_T::HcControl: CLE Position        */
#define USBH_HcControl_CLE_Msk              ( 0x1ul << USBH_HcControl_CLE_Pos )                 /*!< USBH_T::HcControl: CLE Mask            */

#define USBH_HcControl_BLE_Pos              ( 5 )                                               /*!< USBH_T::HcControl: BLE Position        */
#define USBH_HcControl_BLE_Msk              ( 0x1ul << USBH_HcControl_BLE_Pos )                 /*!< USBH_T::HcControl: BLE Mask            */

#define USBH_HcControl_HCFS_Pos             ( 6 )                                               /*!< USBH_T::HcControl: HCFS Position       */
#define USBH_HcControl_HCFS_Msk             ( 0x3ul << USBH_HcControl_HCFS_Pos )                /*!< USBH_T::HcControl: HCFS Mask           */

#define USBH_HcCommandStatus_HCR_Pos        ( 0 )                                               /*!< USBH_T::HcCommandStatus: HCR Position  */
#define USBH_HcCommandStatus_HCR_Msk        ( 0x1ul << USBH_HcCommandStatus_HCR_Pos )           /*!< USBH_T::HcCommandStatus: HCR Mask      */

#define USBH_HcCommandStatus_CLF_Pos        ( 1 )                                               /*!< USBH_T::HcCommandStatus: CLF Position  */
#define USBH_HcCommandStatus_CLF_Msk        ( 0x1ul << USBH_HcCommandStatus_CLF_Pos )           /*!< USBH_T::HcCommandStatus: CLF Mask      */

#define USBH_HcCommandStatus_BLF_Pos        ( 2 )                                               /*!< USBH_T::HcCommandStatus: BLF Position  */
#define USBH_HcCommandStatus_BLF_Msk        ( 0x1ul << USBH_HcCommandStatus_BLF_Pos )           /*!< USBH_T::HcCommandStatus: BLF Mask      */

#define USBH_HcCommandStatus_SOC_Pos        ( 16 )                                              /*!< USBH_T::HcCommandStatus: SOC Position  */
#define USBH_HcCommandStatus_SOC_Msk        ( 0x3ul << USBH_HcCommandStatus_SOC_Pos )           /*!< USBH_T::HcCommandStatus: SOC Mask      */

#define USBH_HcInterruptStatus_SO_Pos       ( 0 )                                               /*!< USBH_T::HcInterruptStatus: SO Position */
#define USBH_HcInterruptStatus_SO_Msk       ( 0x1ul << USBH_HcInterruptStatus_SO_Pos )          /*!< USBH_T::HcInterruptStatus: SO Mask     */

#define USBH_HcInterruptStatus_WDH_Pos      ( 1 )                                               /*!< USBH_T::HcInterruptStatus: WDH Position*/
#define USBH_HcInterruptStatus_WDH_Msk      ( 0x1ul << USBH_HcInterruptStatus_WDH_Pos )         /*!< USBH_T::HcInterruptStatus: WDH Mask    */

#define USBH_HcInterruptStatus_SF_Pos       ( 2 )                                               /*!< USBH_T::HcInterruptStatus: SF Position */
#define USBH_HcInterruptStatus_SF_Msk       ( 0x1ul << USBH_HcInterruptStatus_SF_Pos )          /*!< USBH_T::HcInterruptStatus: SF Mask     */

#define USBH_HcInterruptStatus_RD_Pos       ( 3 )                                               /*!< USBH_T::HcInterruptStatus: RD Position */
#define USBH_HcInterruptStatus_RD_Msk       ( 0x1ul << USBH_HcInterruptStatus_RD_Pos )          /*!< USBH_T::HcInterruptStatus: RD Mask     */

#define USBH_HcInterruptStatus_FNO_Pos      ( 5 )                                               /*!< USBH_T::HcInterruptStatus: FNO Position*/
#define USBH_HcInterruptStatus_FNO_Msk      ( 0x1ul << USBH_HcInterruptStatus_FNO_Pos )         /*!< USBH_T::HcInterruptStatus: FNO Mask    */

#define USBH_HcInterruptStatus_RHSC_Pos     ( 6 )                                               /*!< USBH_T::HcInterruptStatus: RHSC Position*/
#define USBH_HcInterruptStatus_RHSC_Msk     ( 0x1ul << USBH_HcInterruptStatus_RHSC_Pos )        /*!< USBH_T::HcInterruptStatus: RHSC Mask   */

#define USBH_HcInterruptEnable_SO_Pos       ( 0 )                                               /*!< USBH_T::HcInterruptEnable: SO Position */
#define USBH_HcInterruptEnable_SO_Msk       ( 0x1ul << USBH_HcInterruptEnable_SO_Pos )          /*!< USBH_T::HcInterruptEnable: SO Mask     */

#define USBH_HcInterruptEnable_WDH_Pos      ( 1 )                                               /*!< USBH_T::HcInterruptEnable: WDH Position*/
#define USBH_HcInterruptEnable_WDH_Msk      ( 0x1ul << USBH_HcInterruptEnable_WDH_Pos )         /*!< USBH_T::HcInterruptEnable: WDH Mask    */

#define USBH_HcInterruptEnable_SF_Pos       ( 2 )                                               /*!< USBH_T::HcInterruptEnable: SF Position */
#define USBH_HcInterruptEnable_SF_Msk       ( 0x1ul << USBH_HcInterruptEnable_SF_Pos )          /*!< USBH_T::HcInterruptEnable: SF Mask     */

#define USBH_HcInterruptEnable_RD_Pos       ( 3 )                                               /*!< USBH_T::HcInterruptEnable: RD Position */
#define USBH_HcInterruptEnable_RD_Msk       ( 0x1ul << USBH_HcInterruptEnable_RD_Pos )          /*!< USBH_T::HcInterruptEnable: RD Mask     */

#define USBH_HcInterruptEnable_FNO_Pos      ( 5 )                                               /*!< USBH_T::HcInterruptEnable: FNO Position*/
#define USBH_HcInterruptEnable_FNO_Msk      ( 0x1ul << USBH_HcInterruptEnable_FNO_Pos )         /*!< USBH_T::HcInterruptEnable: FNO Mask    */

#define USBH_HcInterruptEnable_RHSC_Pos     ( 6 )                                               /*!< USBH_T::HcInterruptEnable: RHSC Position*/
#define USBH_HcInterruptEnable_RHSC_Msk     ( 0x1ul << USBH_HcInterruptEnable_RHSC_Pos )        /*!< USBH_T::HcInterruptEnable: RHSC Mask   */

#define USBH_HcInterruptEnable_MIE_Pos      ( 31 )                                              /*!< USBH_T::HcInterruptEnable: MIE Position*/
#define USBH_HcInterruptEnable_MIE_Msk      ( 0x1ul << USBH_HcInterruptEnable_MIE_Pos )         /*!< USBH_T::HcInterruptEnable: MIE Mask    */

#define USBH_HcInterruptDisable_SO_Pos      ( 0 )                                               /*!< USBH_T::HcInterruptDisable: SO Position*/
#define USBH_HcInterruptDisable_SO_Msk      ( 0x1ul << USBH_HcInterruptDisable_SO_Pos )         /*!< USBH_T::HcInterruptDisable: SO Mask    */

