FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/usbh_reg.h
#define USBH_HcRhDescriptorA_PSM_Pos        ( 8 )                                               /*!< USBH_T::HcRhDescriptorA: PSM Position  */
#define USBH_HcRhDescriptorA_PSM_Msk        ( 0x1ul << USBH_HcRhDescriptorA_PSM_Pos )           /*!< USBH_T::HcRhDescriptorA: PSM Mask      */

#define USBH_HcRhDescriptorA_OCPM_Pos       ( 11 )                                              /*!< USBH_T::HcRhDescriptorA: OCPM Position */
#define USBH_HcRhDescriptorA_OCPM_Msk       ( 0x1ul << USBH_HcRhDescriptorA_OCPM_Pos )          /*!< USBH_T::HcRhDescriptorA: OCPM Mask     */

#define USBH_HcRhDescriptorA_NOCP_Pos       ( 12 )                                              /*!< USBH_T::HcRhDescriptorA: NOCP Position */
#define USBH_HcRhDescriptorA_NOCP_Msk       ( 0x1ul << USBH_HcRhDescriptorA_NOCP_Pos )          /*!< USBH_T::HcRhDescriptorA: NOCP Mask     */

#define USBH_HcRhDescriptorB_PPCM_Pos       ( 16 )                                              /*!< USBH_T::HcRhDescriptorB: PPCM Position */
#define USBH_HcRhDescriptorB_PPCM_Msk       ( 0xfffful << USBH_HcRhDescriptorB_PPCM_Pos )       /*!< USBH_T::HcRhDescriptorB: PPCM Mask     */

#define USBH_HcRhStatus_LPS_Pos             ( 0 )                                               /*!< USBH_T::HcRhStatus: LPS Position       */
#define USBH_HcRhStatus_LPS_Msk             ( 0x1ul << USBH_HcRhStatus_LPS_Pos )                /*!< USBH_T::HcRhStatus: LPS Mask           */

#define USBH_HcRhStatus_OCI_Pos             ( 1 )                                               /*!< USBH_T::HcRhStatus: OCI Position       */
#define USBH_HcRhStatus_OCI_Msk             ( 0x1ul << USBH_HcRhStatus_OCI_Pos )                /*!< USBH_T::HcRhStatus: OCI Mask           */

#define USBH_HcRhStatus_DRWE_Pos            ( 15 )                                              /*!< USBH_T::HcRhStatus: DRWE Position      */
#define USBH_HcRhStatus_DRWE_Msk            ( 0x1ul << USBH_HcRhStatus_DRWE_Pos )               /*!< USBH_T::HcRhStatus: DRWE Mask          */

#define USBH_HcRhStatus_LPSC_Pos            ( 16 )                                              /*!< USBH_T::HcRhStatus: LPSC Position      */
#define USBH_HcRhStatus_LPSC_Msk            ( 0x1ul << USBH_HcRhStatus_LPSC_Pos )               /*!< USBH_T::HcRhStatus: LPSC Mask          */

#define USBH_HcRhStatus_OCIC_Pos            ( 17 )                                              /*!< USBH_T::HcRhStatus: OCIC Position      */
#define USBH_HcRhStatus_OCIC_Msk            ( 0x1ul << USBH_HcRhStatus_OCIC_Pos )               /*!< USBH_T::HcRhStatus: OCIC Mask          */

#define USBH_HcRhStatus_CRWE_Pos            ( 31 )                                              /*!< USBH_T::HcRhStatus: CRWE Position      */
#define USBH_HcRhStatus_CRWE_Msk            ( 0x1ul << USBH_HcRhStatus_CRWE_Pos )               /*!< USBH_T::HcRhStatus: CRWE Mask          */

#define USBH_HcRhPortStatus_CCS_Pos         ( 0 )                                               /*!< USBH_T::HcRhPortStatus: CCS Position   */
#define USBH_HcRhPortStatus_CCS_Msk         ( 0x1ul << USBH_HcRhPortStatus_CCS_Pos )            /*!< USBH_T::HcRhPortStatus: CCS Mask       */

#define USBH_HcRhPortStatus_PES_Pos         ( 1 )                                               /*!< USBH_T::HcRhPortStatus: PES Position   */
#define USBH_HcRhPortStatus_PES_Msk         ( 0x1ul << USBH_HcRhPortStatus_PES_Pos )            /*!< USBH_T::HcRhPortStatus: PES Mask       */

#define USBH_HcRhPortStatus_PSS_Pos         ( 2 )                                               /*!< USBH_T::HcRhPortStatus: PSS Position   */
#define USBH_HcRhPortStatus_PSS_Msk         ( 0x1ul << USBH_HcRhPortStatus_PSS_Pos )            /*!< USBH_T::HcRhPortStatus: PSS Mask       */

#define USBH_HcRhPortStatus_POCI_Pos        ( 3 )                                               /*!< USBH_T::HcRhPortStatus: POCI Position  */
#define USBH_HcRhPortStatus_POCI_Msk        ( 0x1ul << USBH_HcRhPortStatus_POCI_Pos )           /*!< USBH_T::HcRhPortStatus: POCI Mask      */

#define USBH_HcRhPortStatus_PRS_Pos         ( 4 )                                               /*!< USBH_T::HcRhPortStatus: PRS Position   */
#define USBH_HcRhPortStatus_PRS_Msk         ( 0x1ul << USBH_HcRhPortStatus_PRS_Pos )            /*!< USBH_T::HcRhPortStatus: PRS Mask       */

#define USBH_HcRhPortStatus_PPS_Pos         ( 8 )                                               /*!< USBH_T::HcRhPortStatus: PPS Position   */
#define USBH_HcRhPortStatus_PPS_Msk         ( 0x1ul << USBH_HcRhPortStatus_PPS_Pos )            /*!< USBH_T::HcRhPortStatus: PPS Mask       */

#define USBH_HcRhPortStatus_LSDA_Pos        ( 9 )                                               /*!< USBH_T::HcRhPortStatus: LSDA Position  */
#define USBH_HcRhPortStatus_LSDA_Msk        ( 0x1ul << USBH_HcRhPortStatus_LSDA_Pos )           /*!< USBH_T::HcRhPortStatus: LSDA Mask      */

#define USBH_HcRhPortStatus_CSC_Pos         ( 16 )                                              /*!< USBH_T::HcRhPortStatus: CSC Position   */
#define USBH_HcRhPortStatus_CSC_Msk         ( 0x1ul << USBH_HcRhPortStatus_CSC_Pos )            /*!< USBH_T::HcRhPortStatus: CSC Mask       */

#define USBH_HcRhPortStatus_PESC_Pos        ( 17 )                                              /*!< USBH_T::HcRhPortStatus: PESC Position  */
#define USBH_HcRhPortStatus_PESC_Msk        ( 0x1ul << USBH_HcRhPortStatus_PESC_Pos )           /*!< USBH_T::HcRhPortStatus: PESC Mask      */

#define USBH_HcRhPortStatus_PSSC_Pos        ( 18 )                                              /*!< USBH_T::HcRhPortStatus: PSSC Position  */
#define USBH_HcRhPortStatus_PSSC_Msk        ( 0x1ul << USBH_HcRhPortStatus_PSSC_Pos )           /*!< USBH_T::HcRhPortStatus: PSSC Mask      */

#define USBH_HcRhPortStatus_OCIC_Pos        ( 19 )                                              /*!< USBH_T::HcRhPortStatus: OCIC Position  */
#define USBH_HcRhPortStatus_OCIC_Msk        ( 0x1ul << USBH_HcRhPortStatus_OCIC_Pos )           /*!< USBH_T::HcRhPortStatus: OCIC Mask      */

#define USBH_HcRhPortStatus_PRSC_Pos        ( 20 )                                              /*!< USBH_T::HcRhPortStatus: PRSC Position  */
#define USBH_HcRhPortStatus_PRSC_Msk        ( 0x1ul << USBH_HcRhPortStatus_PRSC_Pos )           /*!< USBH_T::HcRhPortStatus: PRSC Mask      */

#define USBH_HcPhyControl_STBYEN_Pos        ( 27 )                                              /*!< USBH_T::HcPhyControl: STBYEN Position  */
#define USBH_HcPhyControl_STBYEN_Msk        ( 0x1ul << USBH_HcPhyControl_STBYEN_Pos )           /*!< USBH_T::HcPhyControl: STBYEN Mask      */

#define USBH_HcMiscControl_ABORT_Pos        ( 1 )                                               /*!< USBH_T::HcMiscControl: ABORT Position  */
#define USBH_HcMiscControl_ABORT_Msk        ( 0x1ul << USBH_HcMiscControl_ABORT_Pos )           /*!< USBH_T::HcMiscControl: ABORT Mask      */

#define USBH_HcMiscControl_OCAL_Pos         ( 3 )                                               /*!< USBH_T::HcMiscControl: OCAL Position   */
#define USBH_HcMiscControl_OCAL_Msk         ( 0x1ul << USBH_HcMiscControl_OCAL_Pos )            /*!< USBH_T::HcMiscControl: OCAL Mask       */

#define USBH_HcMiscControl_DPRT1_Pos        ( 16 )                                              /*!< USBH_T::HcMiscControl: DPRT1 Position  */
#define USBH_HcMiscControl_DPRT1_Msk        ( 0x1ul << USBH_HcMiscControl_DPRT1_Pos )           /*!< USBH_T::HcMiscControl: DPRT1 Mask      */

/**@}*/ /* USBH_CONST */
/**@}*/ /* end of USBH register group */
/**@}*/ /* end of REGISTER group */

#endif /* __USBH_REG_H__ */
